// Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.

// Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. Обов'язково використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.

// Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 'У вашій країні доставка недоступна'.

// Нижче наведено список країн і вартість доставки.

// Китай - 100 кредитів
// Чилі - 250 кредитів
// Австралія - 170 кредитів
// Індія - 80 кредитів
// Ямайка - 120 кредитів

const WhatCountry = prompt("Яка країна доставки?");

let message;

switch (WhatCountry.toLowerCase()) {
  case "китай":
    message = "Доставка в Китай буде коштувати 100 кредитів.";
    break;
  case "чилі":
    message = "Доставка в Чилі буде коштувати 250 кредитів.";
    break;
  case "австралія":
    message = "Доставка в Австралію буде коштувати 170 кредитів.";
    break;
  case "індія":
    message = "Доставка в Індію буде коштувати 80 кредитів.";
    break;
  case "ямайка":
    message = "Доставка в Ямайку буде коштувати 120 кредитів.";
    break;
  default:
    message = "У вашій країні доставка недоступна.";
    break;
}
alert(message);
